## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                          RESOURCE                           |
|----------|-------------------------------------------------------------|
| add      | `aws_service_discovery_private_dns_namespace.superset`      |
|          | `module.superset_ecs.aws_service_discovery_service.this[0]` |
| update   | `aws_iam_policy.superset_athena_read`                       |
|          | `module.superset_ecs.aws_ecs_service.this`                  |
| recreate | `module.superset_ecs.aws_ecs_task_definition.this`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.superset_athena_read will be updated in-place
  ~ resource "aws_iam_policy" "superset_athena_read" {
        id        = "arn:aws:iam::066023111852:policy/SupersetAthenaRead"
        name      = "SupersetAthenaRead"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "glue:GetTables",
                            "glue:GetTableVersions",
                            "glue:GetTableVersion",
                            "glue:GetTable",
                            "glue:GetPartitions",
                            "glue:GetPartition",
                            "glue:GetDatabases",
                            "glue:GetDatabase",
                            "glue:BatchGetPartition",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "GlueRead"
                    },
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:s3:::713f18dd-9f30-4976-a152-e81d48cf053a",
                          - "arn:aws:s3:::5bf89a78-1503-4e02-9621-3ac658f558fb/*",
                          - "arn:aws:s3:::5bf89a78-1503-4e02-9621-3ac658f558fb",
                          - "arn:aws:s3:::4d9f3f22-cff9-4407-ab55-a0d2373b382e/*",
                          - "arn:aws:s3:::4d9f3f22-cff9-4407-ab55-a0d2373b382e",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:ListBucket",
                            "s3:GetObject",
                            "s3:GetBucketLocation",
                            "s3:AbortMultipartUpload",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::calvinrodotestbucket/*",
                            "arn:aws:s3:::calvinrodotestbucket",
                        ]
                        Sid      = "S3AthenaResultBucketWrite"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {
            "Terraform" = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_service_discovery_private_dns_namespace.superset will be created
  + resource "aws_service_discovery_private_dns_namespace" "superset" {
      + arn         = (known after apply)
      + description = "DNS namespace used to provide service discovery for the Superset ECS services (application and Celery workers)"
      + hosted_zone = (known after apply)
      + id          = (known after apply)
      + name        = "superset.ecs.local"
      + tags        = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + vpc         = "vpc-0010287ba1021cc5c"
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset"
        name                               = "superset"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:14" -> (known after apply)
        # (15 unchanged attributes hidden)

      + service_registries {
          + container_name = "superset"
          + registry_arn   = (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:13" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - essential              = true
                  ~ image                  = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest" -> "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:sha-4affc391bad32289b0033e5ef8fece57d661a3f3"
                  - mountPoints            = []
                    name                   = "superset"
                  - volumesFrom            = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "superset" -> (known after apply)
      ~ revision                 = 13 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.superset_ecs.aws_service_discovery_service.this[0] will be created
  + resource "aws_service_discovery_service" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "superset"
      + namespace_id  = (known after apply)
      + tags          = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (known after apply)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 5
        }
    }

Plan: 3 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.cur_data_extract"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_s3_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["module.superset-redis.aws_elasticache_subnet_group.default"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
